Other/N2F/Src/Symbian/Clien-Server_approach/Server/Polymorphic_libs/PhotoOrganiseService/gsoap/PhotoOrganiseSoap12.JavaUploadPhoto.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns3="http://tempuri.org/PhotoOrganiseSoap"
 xmlns:ns1="http://tempuri.org/"
 xmlns:ns4="http://tempuri.org/PhotoOrganiseSoap12">
 <SOAP-ENV:Body>
   <ns1:JavaUploadPhoto>
    <ns1:EncryptedWebMemberID></ns1:EncryptedWebMemberID>
    <ns1:WebPhotoCollectionID></ns1:WebPhotoCollectionID>
    <ns1:Base64StringPhoto></ns1:Base64StringPhoto>
    <ns1:DateTime></ns1:DateTime>
   </ns1:JavaUploadPhoto>

 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
